import cn from "classnames";
import s from "./terms_of_use/TermsOfUse.module.scss";


function TermsOfUse() {
    return (
        <main className={cn(s._, 'wrapper')}>
            <h3 className={s.title}>Условия использования</h3>

            <div className="text">

                <p>Положения данного соглашения (“Условия Пользования”) регулируют отношения между вами и ООО «Азур Геймс» &nbsp;(далее по тексту “Azur games”) относительно использования вами (“Пользователь”) игры ,внутриигровых чатов и любых других
                    сервисов “Преферанс: игра в карты онлайн” (“Сервис”), предоставленных Azur Games.</p>


                <p>При каждом доступе и/или фактическом использовании Сервиса, Пользователь соглашается с условиями настоящего Пользовательского Соглашения.</p>


                <p>Присоединение Пользователя к Условия Пользования осуществляется путем нажатия кнопки («ПРИНЯТЬ УСЛОВИЯ СОГЛАШЕНИЯ») в момент процедуры создания учетной записи на Сервисе, чем подтверждается ознакомление и безоговорочное согласие
                    Пользователя с Условия Пользования.</p>


                <p>А ТАКЖЕ ПОДТВЕРЖДАЕТЕ, ЧТО ВЫ ДОСТИГЛИ ВОЗРАСТА ДЕЕСПОСОБНОСТИ И ИМЕЕТЕ ЗАКОННОЕ ПРАВО ПОЛЬЗОВАТЬСЯ ДАННЫМИ УСЛУГАМИ. ЕСЛИ ВЫ НЕ ДОСТИГЛИ ВОЗРАСТА ДЕЕСПОСОБНОСТИ, ТО ВЫ ПОДТВЕРЖДАЕТЕ, ЧТО ВАШ ЗАКОННЫЙ ПРЕДСТАВИТЕЛЬ ОЗНАКОМИЛСЯ И
                    СОГЛАСИЛСЯ С ДАННЫМИ УСЛОВИЯМИ ПОЛЬЗОВАНИЯ. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С ПОЛОЖЕНИЯМИ НАСТОЯЩИХ УСЛОВИЙ ПОЛЬЗОВАНИЯ, И НЕ ОСУЩЕСТВЛЯЙТЕ ДОСТУП К СЕРВИСАМ AZUR GAMES ЛЮБЫМ ДРУГИМ СПОСОБОМ. ИСПОЛЬЗОВАНИЕ СЕРВИСА БЕЗ СОГЛАСИЯ С НАСТОЯЩИМИ
                    УСЛОВИЯМИ ПОЛЬЗОВАНИЯ СТРОГО ЗАПРЕЩЕНО.</p>


                <p><strong>1. Общие условия</strong></p>


                <p>Azur Games предоставляет доступ к Сервису посредством персонального компьютера, а также мобильных и иных устройств, как существующих в настоящее время, так и тех, которые будут разработаны в будущем.</p>


                <p>Пользователь осознает и соглашается, что Сервис может содержать рекламу, и что наличие данной рекламы является необходимым условием использования Сервиса.</p>


                <p>Сервис предоставляются «как есть». Azur Games не принимает на себя никакой ответственности за задержку, удаление, недоставку или невозможность загрузить любые данные Пользователя, в том числе настройки Пользователя, а также не
                    несет ответственности за соответствие Сервиса целям Пользователя. Все вопросы предоставления прав доступа к сети Интернет, покупки и наладки для этого соответствующего оборудования и программных продуктов решаются Пользователем
                    самостоятельно и не подпадают под действие настоящего Пользовательского соглашения.</p>


                <p>Пользователь соглашается с тем, что Azur Games может осуществлять сбор обезличенных статистических данных о Пользователях Сервиса.</p>


                <p>Azur Games вправе устанавливать любые дополнительные требования и ограничения применительно к регистрации на Сайте и использованию Сервиса.</p>


                <p>СЕРВИС НЕ ПРЕДОСТАВЛЯЕТ ВОЗМОЖНОСТЬ ИГРЫ НА ДЕНЬГИ (ДЕНЕЖНУЮ ИЛИ ИНУЮ СТАВКУ). AZUR GAMES НЕ ВЫПЛАЧИВАЕТ ДЕНЕЖНЫЕ СРЕДСТВА ПОЛЬЗОВАТЕЛЯМ, И НЕ ВЫДАЕТ ИНЫЕ МАТЕРИАЛЬНЫЕ ПРИЗЫ (КРОМЕ ДИПЛОМОВ/МЕДАЛЕЙ В НЕКОТОРЫХ СПЕЦИАЛЬНЫХ КРУПНЫХ
                    СОРЕВНОВАНИЯХ).</p>


                <p>Платежи, сделанные Пользователем в пользу Azur Games, не возвращаются ни при каких обстоятельствах.</p>


                <p>ИГРА НА ДЕНЕЖНУЮ ИЛИ ДРУГУЮ СТАВКУ СТРОГО ЗАПРЕЩЕНА. ПОЛЬЗОВАТЕЛЬ ОБЯЗУЕТСЯ НЕ ИСПОЛЬЗОВАТЬ СЕРВИС ДЛЯ ПОДОБНОЙ ИГРЫ ПО ДОГОВОРЕННОСТИ С ДРУГИМИ ПОЛЬЗОВАТЕЛЯМИ.</p>


                <p><strong>2. Права и лицензионные ограничения</strong><strong></strong></p>


                <p>Все права на Сервис являются собственностью Azur Games.</p>


                <p>Azur Games владеет всеми данными, являющимися частью Сервиса. Вы осознаете и подтверждаете, что любой внутриигровой контент, предоставляемый в Сервисе, в том числе без ограничения (а) “Виртуальное имущество” , присутствующий в
                    Сервисах, предоставляемых Azur Games, не принадлежит вам и вы не имеете на него никаких прав, вне зависимости от того, была ли приобретена вами на него лицензия у Azur Games или получена бесплатно внутри Сервиса. Вы осознаете и
                    соглашаетесь, что не владеете и не имеете никаких прав на ваш Аккаунт, а также что все права на ваш Аккаунт являются и всегда будут являться собственностью Azur Games.</p>


                <p>Настоящим Azur Games предоставляет вам неисключительную, отзывную, непередаваемую лицензию на доступ к Сервису для ваших некоммерческих, исключительно развлекательных целей, при обязательном условии вашего согласия с данными
                    Условиями Пользования.</p>


                <p>За исключением наличия письменного разрешения от Azur Games, вам запрещается воспроизводить, распространять, копировать, модифицировать, публиковать, создавать производные продукты Сервиса, а также любой интеллектуальной
                    собственности, принадлежащей Azur Games.</p>


                <p>Любое нарушение прав или использование не в соответствии с данными Условиями Пользования строго запрещено и может повлечь за собой гражданскую или уголовную ответственность.</p>


                <p><strong>3. Покупки</strong></p>


                <p>В рамках Сервиса у вас есть возможность приобрести за “реальные” деньги неисключительную, непередаваемую, в частности в порядке сублицензирования, отзывную лицензию на использование “Виртуального имущества”.</p>


                <p>Вы имеете право на приобретение Виртуального имущества исключительно у Azur Games, любые другие способы приобретения запрещены.</p>


                <p>Вы подтверждаете, что любое Виртуального имущество, на использование которого вами была приобретена лицензия, не является вашей собственностью и не принадлежит вам. ВИРТУАЛЬНОЕ ИМУЩЕСТВО НЕ ИМЕЕТ НИКАКОЙ ДЕНЕЖНОЙ ЦЕННОСТИ И НЕ
                    МОЖЕТ БЫТЬ ВЫКУПЛЕНО ЗА НАЛИЧНЫЕ ДЕНЬГИ. Вы соглашаетесь, что все приобретения лицензий на использование Виртуального имущества финальны и не подлежат обмену и возврату.</p>


                <p>Azur Games оставляет за собой право вносить изменения в цену лицензии на Виртуальное имущество и/или снижать ее, сокращать количество доступных лицензий или делать их недоступными для покупки, а также может в любое время
                    регулировать, модифицировать, вносить изменения или удалять Виртуальное имущество с уведомлением или без него. Azur Games не несет ответственности перед вами или какими бы то ни было третьими лицами в случае, если Azur Games
                    воспользуется любым из вышеперечисленных прав.</p>


                <p>&nbsp;Пользователь соглашается, что за услуги, оказываемые ему на условиях подписки (такие, для которых определен срок действия услуги), может быть произведено автоматическое списание оплаты продления услуги с сохраненного
                    платежного инструмента (карты или другого) без подтверждения Пользователя.</p>


                <p>&nbsp;Azur Games обязуется не делать без ведома Пользователя иных списаний, кроме необходимых для автопродления услуг, заказанных Пользователем.</p>


                <p>Подписка на платную услугу может быть отменена Пользователем в любой момент по его желанию.</p>


                <p><strong>4. Обновления и модификации продукта</strong><strong></strong></p>


                <p>Azur Games оставляет за собой право модифицировать, видоизменять, обновлять любые составляющие Сервиса, в том числе Виртуальное имущество, Виртуальные внутриигровые предметы, а также любые другие внутриигровые механики, функции
                    и &nbsp;спецификации Сервиса с предварительным оповещением или без. Azur Games не несет перед вами ответственности за любые обновления и модификации продукта и любых его составляющих.</p>


                <p><strong>5. Прекращение деятельности соглашения</strong><strong></strong></p>


                <p>Вы осознаете и подтверждаете, что если, вне зависимости от обстоятельств, вами будет нарушено любое из данных Условий пользования, независимо от того, было ли нарушение преднамеренным или случайным, действие данных Условия
                    пользования будет автоматически прекращено. После прекращения вы обязаны незамедлительно приостановить любое использование Сервиса Azur Games. Вы осознаете и соглашаетесь, что Azur Games имеет право деактивировать и/или удалить
                    ваш аккаунт в любое время по любой причине или без с предварительным оповещением или без.</p>


                <p><strong>6. ОБНОВЛЕНИЯ УСЛОВИЙ ПОЛЬЗОВАНИЯ</strong><strong></strong></p>


                <p>Вы осознаете и соглашаетесь, что Azur Games оставляет за собой право обновлять, вносить изменения или править данные Условия Пользования в любое время посредством публикации обновленной версии на веб-сайт ww.pref.ru . Обновленные
                    Условия Пользования вступают в силу незамедлительно с момента публикации. Вам рекомендуется время от времени проверять веб-сайт на наличие подобных обновлений.</p>
            </div>
        </main>
    );
}

export default TermsOfUse;