import cn from "classnames";
import s from "./terms_of_use/TermsOfUse.module.scss";


function TermsOfUse() {
    return (
        <main className={cn(s._, 'wrapper')}>
            <h3 className={s.title}>Условия пользования</h3>

            <div className="text">

                <p>Положения данного соглашения (“Условия Пользования”) регулируют отношения между вами и Azur Interactive Games Limited (далее по тексту “Azur games”) относительно использования вами игр, мобильных приложения, внутриигровых чатов и
                    любых других сервисов (“Сервис”), предоставленных Azur Games. Использование Сервиса также регулируется Политикой конфиденциальности Azur Games, которая полностью включена в данные условия.</p>


                <p>СКАЧИВАЯ, УСТАНАВЛИВАЯ, ИСПОЛЬЗУЯ ИЛИ ЛЮБЫМ ДРУГИМ СПОСОБОМ ПОЛУЧАЯ ДОСТУП К СЕРВИСАМ, ПРЕДОСТАВЛЯЕМЫМ AZUR GAMES, ВЫ ПОДТВЕРЖДАЕТЕ, ЧТО ВЫ ПРОЧЛИ, ПОНЯЛИ И СОГЛАШАЕТЕСЬ С ПОЛОЖЕНИЯМИ НАСТОЯЩИХ УСЛОВИЙ ПОЛЬЗОВАНИЯ И ПОЛИТИКОЙ
                    КОНФИДЕНЦИАЛЬНОСТИ; А ТАКЖЕ ПОДТВЕРЖДАЕТЕ, ЧТО ВЫ ДОСТИГЛИ ВОЗРАСТА ДЕЕСПОСОБНОСТИ В СТРАНЕ ВАШЕГО ПРОЖИВАНИЯ И ИМЕЕТЕ ЗАКОННОЕ ПРАВО ПОЛЬЗОВАТЬСЯ ДАННЫМИ УСЛУГАМИ. ЕСЛИ ВЫ НЕ ДОСТИГЛИ ВОЗРАСТА ДЕЕСПОСОБНОСТИ, ТО ВЫ ПОДТВЕРЖДАЕТЕ,
                    ЧТО ВАШ ЗАКОННЫЙ ПРЕДСТАВИТЕЛЬ ОЗНАКОМИЛСЯ И СОГЛАСИЛСЯ С ДАННЫМИ УСЛОВИЯМИ ПОЛЬЗОВАНИЯ. ЕСЛИ ВЫ НЕ СОГЛАСНЫ С ПОЛОЖЕНИЯМИ НАСТОЯЩИХ УСЛОВИЙ ПОЛЬЗОВАНИЯ, НЕ СКАЧИВАЙТЕ И НЕ ОСУЩЕСТВЛЯЙТЕ ДОСТУП К СЕРВИСАМ AZUR GAMES ЛЮБЫМ ДРУГИМ
                    СПОСОБОМ. ИСПОЛЬЗОВАНИЕ СЕРВИСОВ БЕЗ СОГЛАСИЯ С НАСТОЯЩИМИ УСЛОВИЯМИ ПОЛЬЗОВАНИЯ СТРОГО ЗАПРЕЩЕНО.</p>
                <br/>


                <p><strong>1. Аккаунт</strong></p>


                <p>Вы можете использовать ваш аккаунт исключительно для ваших личных, некоммерческих целей. Вы подтверждаете, что не будете делиться информацией о вашем Аккаунте, необходимой для входа в ваш аккаунт (такой как логин и пароль аккаунта
                    Google Play или Apple ID), а также не будете давать доступ к вашему Аккаунту третьим лицам или производить любые действия, которые могут поставить под угрозу безопасность вашего Аккаунта и информацию, необходимую для входа в ваш
                    Аккаунт, и вы будете нести полную ответственность за любые использования ваших авторизационных данных, в том числе за любые покупки или изменения, внесенные в ваш Аккаунт, вне зависимости от того, были ли они авторизованы вами
                    лично. Вы подтверждаете, что несете ответственность за любые действия, производимые через ваш Аккаунт и/или с вашим Аккаунтом в результате вашего предоставления данных для входа в него третьим лицам. В случае если вы становитесь
                    свидетелем или обоснованно подозреваете нарушение безопасности, в том числе без ограничений любую потерю, кражу или неавторизованное раскрытие информации, необходимой для входа в ваш Аккаунт, вы обязуетесь немедленно известить
                    Azur Games и изменить авторизационные данные. В отсутствие своевременного оповещения мы не можем гарантировать безопасность вашего прогресса в наших Сервисах.</p>
                <br/>

                <p><strong>2. Права и лицензионные ограничения</strong></p>


                <p>Все права на Сервисы, включая все приложения, компьютерные коды, объекты, персонажей, диалоги, концепции, крылатые фразы, художественное оформление, анимацию, звуки и аудио эффекты, музыкальные композиции, аудиовизуальные эффекты,
                    методы оперирования, документацию, расшифровки внутриигровых чатов, информацию о персонажах, записи игр с использованием игровых клиентов и серверного оборудования, являются собственностью Azur Games.</p>

                <p>Azur Games владеет всеми данными, являющимися частью Сервисов. Вы осознаете и подтверждаете, что любой внутриигровой контент, предоставляемый в Сервисах, в том числе без ограничения (а) “Виртуальное имущество”, (б) “Виртуальная
                    валюта” или (в) “Атрибутика”, присутствующий в Сервисах, предоставляемых Azur Games, не принадлежит вам и вы не имеете на него никаких прав, вне зависимости от того, была ли приобретена вами на него лицензия у Azur Games или
                    получена бесплатно внутри Сервисов. Вы осознаете и соглашаетесь, что не владеете и не имеете никаких прав на ваш Аккаунт, а также что все права на ваш Аккаунт являются и всегда будут являться собственностью Azur Games.</p>


                <p>Настоящим Azur Games предоставляет вам неисключительную, отзывную, непередаваемую лицензию на доступ к Сервисам Azur Games для ваших некоммерческих, исключительно развлекательных целей, при обязательном условии вашего согласия с
                    данными Условиями Пользования.</p>


                <p>За исключением наличия письменного разрешения от Azur Games, вам запрещается воспроизводить, распространять, копировать, модифицировать, публиковать, создавать производные продукты Сервисов, а также любой интеллектуальной
                    собственности, принадлежащей Azur Games.</p>


                <p>Любое нарушение прав или использование не в соответствии с данными Условиями Пользования строго запрещено и может повлечь за собой гражданскую или уголовную ответственность.</p>
                <br/>

                <p><strong>3. Ограничение лицензии</strong></p>


                <p>Вы подтверждаете, что во время использования Сервисов Azur Games, вы не станете, ни при каких обстоятельствах:</p>


                <ul>
                    <li>Выступать инициатором, принимать участие (прямо или косвенно) в любого рода атаках, в том числе хакерской атаке, распространении и/или использовании любых вирусов, “червей”, вредоносного программного обеспечения или кодов,
                        предназначенных для вмешательства в Сервисы и любые их внутренние функции или любых попыток нарушить функционирование Сервисов и помешать использованию Сервисов другими пользователями.
                    </li>
                    <li>Беспокоить, оскорблять, угрожать, запугивать других пользователей, а также размещать какой бы то ни было непристойный, оскорбительный, порнографический или незаконный контент, который бы нарушал права других пользователей.
                        Использовать ошибки системы предоставляемых Сервисов и/или распространять их, а также агитировать любым способом использование этих ошибок других пользователей.
                    </li>
                    <li>Пытаться получить доступ к Аккаунту другого пользователя, собирать и хранить персональные данные других пользователей, а также пытаться получить авторизационные данные других пользователей.</li>
                    <li>Пытаться получить неавторизованный доступ к Сервисам, в частности к Аккаунтам, зарегистрированным на других пользователей, к серверам или сетям, подсоединенным к Сервисам не посредством пользовательского интерфейса,
                        предоставляемого Azur Games, включая обход или модификацию какого-либо средства защиты Сервисов, попытку и/или подстрекательство обхода или модификации, а также содействие в этом.
                    </li>
                    <li>Применять какое-либо программное обеспечение, технологию или код в Сервисах с целью сбора контента, персональных данных других пользователей или любой другой информации, хранящейся на Сервисах, включая любую
                        пользовательскую
                        информацию.
                    </li>
                    <li>Защищать, поощрять, поддерживать или любым другим способом содействовать какому бы то ни было незаконному поведению (в том числе, распространению наркотических веществ, противозаконным азартным играм, кражам, причинению
                        вреда
                        человеческой жизни и здоровью), либо способствовать пренебрежению и/или нарушению данных Условий Пользования.
                    </li>
                </ul>
                <br/>

                <p><strong>4. Покупки</strong></p>


                <p>В рамках Сервисов у вас есть возможность приобрести за “реальные” деньги неисключительную, непередаваемую, в частности в порядке сублицензирования, отзывную лицензию на использование “Виртуального имущества” такого как: (а)
                    “Виртуальная валюта”, (б) “Виртуальные внутриигровые предметы”, (в) другие товары или услуги.</p>

                <p>Вы имеете право на приобретение Виртуального имущества исключительно у Azur Games или у авторизованных нами партнеров, любые другие способы приобретения запрещены.</p>

                <p>Вы подтверждаете, что любое Виртуального имущество, на использование которого вами была приобретена лицензия, не является вашей собственностью и не принадлежит вам. Виртуальное имущество не имеет никакой денежной ценности и не
                    может быть выкуплено за наличные деньги. Вы соглашаетесь, что все приобретения лицензий на использование Виртуального имущества финальны и не подлежат обмену и возврату за исключением случаев авторизованных Azur Games в письменной
                    форме.</p>


                <p>Azur Games оставляет за собой право вносить изменения в цену лицензии на Виртуальное имущество и/или снижать ее, сокращать количество доступных лицензий или делать их недоступными для покупки, а также может в любое время
                    регулировать, модифицировать, вносить изменения или удалять Виртуальное имущество с уведомлением или без него. Azur Games не несет ответственности перед вами или какими бы то ни было третьими лицами в случае, если Azur Games
                    воспользуется любым из вышеперечисленных прав.</p>

                <br/>

                <p><strong>5. Пользовательский контент</strong></p>


                <p>Сервисы Azur Games могут включать в себя возможность участвовать в групповых беседах, опросах (как в публичных так и в закрытых), или любым другим образом создавать, отправлять и публиковать тексты, графические и прочие материалы
                    (“Пользовательский контент”). Вы соглашаетесь, гарантируете и обязуетесь, что любые из созданных, отправленных и/или опубликованных вами материалов являются (а) не конфиденциальными, (б) не вводящими в заблуждение или ложными, (в)
                    не противоречащими никаким законам, договорным обязательствам, и не нарушающими права третьих лиц, (в) данные материалы не содержат персональных данных или интеллектуальной собственности, на использование которые у вас нет
                    официального разрешения, а также каких бы то ни было вирусов, вредоносного программного обеспечения, “червей” или любого другого вредоносного кода, (г) вы осознаете и соглашаетесь, что любые персональные данные, предоставляемые
                    вами внутри Пользовательского контента, могут быть обработаны и использованы Azur Games в соответствии с данными Условия пользования.</p>


                <p>Вы осознаете и соглашаетесь, что во время использования Сервисов Azur Games, вы можете столкнуться с Пользовательским контентом и действиями других пользователей, которые являются оскорбительными, непристойными, нецензурными или не
                    соответствующими вашим ожиданиям. Azur Games оставляет за собой право, по своему усмотрению, проверять, редактировать, отказываться публиковать или удалять любой Пользовательский контент. Вы осознаете и соглашаетесь, что Azur
                    Games, тем не менее, не имеет обязательств модерировать или удалять неуместный Пользовательский контент и что Azur Games не несет перед вами или третьими лицами никакой ответственности за Пользовательский контент, а также за любые
                    понесенные убытки, связанные с ним.</p>

                <br/>

                <p><strong>6. Обновления и модификации продукта</strong></p>


                <p>Azur Games оставляет за собой право модифицировать, видоизменять, обновлять любые составляющие Сервисов, в том числе Виртуальное имущество, Виртуальные внутриигровые предметы, а также любые другие внутриигровые механики, функции и
                    спецификации Сервисов с предварительным оповещением или без. Azur Games не несет перед вами ответственности за любые обновления и модификации продукта и любых его составляющих.</p>

                <p>Вы осознаете и соглашаетесь, что Azur Games может потребовать от вас загрузки и установки обновлений Сервисов для дальнейшего доступа к ним и возможности их использования. Вы также осознаете и соглашаетесь, что Azur Games может
                    размещать автоматические обновления и/или модификации Сервисов, не требующие от вас ручной установки, оповещая вас об этом или нет.</p>

                <br/>

                <p><strong>7. Прекращение деятельности соглашения</strong></p>


                <p>Вы осознаете и подтверждаете, что если, вне зависимости от обстоятельств, вами будет нарушено любое из данных Условий пользования, независимо от того, было ли нарушение преднамеренным или случайным, действие данных Условия
                    пользования будет автоматически прекращено. После прекращения вы обязаны незамедлительно приостановить любое использование Сервисов Azur Games. Вы осознаете и соглашаетесь, что Azur Games имеет право деактивировать и/или удалить
                    ваш аккаунт в любое время по любой причине или без с предварительным оповещением или без. Вы соглашаетесь, что ваши обязательства, указанные в следующих пунктах: “2. Права и лицензионные ограничения”, “3. Ограничение лицензии”,
                    “5. Пользовательский контент” остаются в силе после прекращения деятельности данных Условий Пользования.</p>

                <br/>

                <p><strong>8. ГАРАНТИИ И ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ</strong></p>


                <p>В МАКСИМАЛЬНОЙ СТЕПЕНИ, РАЗРЕШЕННОЙ ЗАКОНОДАТЕЛЬСТВОМ, AZUR GAMES НЕ ПРЕДОСТАВЛЯЕТ НИКАКИХ ГАРАНТИЙ И ЗАВЕРЕНИЙ ЛЮБОГО РОДА, А ТАКЖЕ ОТКРЫТО ОТКАЗЫВАЕТСЯ ОТ ЛЮБЫХ ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ ЗАКОНОДАТЕЛЬСТВОМ ГАРАНТИЙ В
                    ОТНОШЕНИИ ПРЕДОСТАВЛЯЕМЫХ СЕРВИСОВ. ВСЕ СЕРВИСЫ AZUR GAMES ПРЕДОСТАВЛЕНЫ “КАК ЕСТЬ”, И AZUR GAMES НЕ ГАРАНТИРУЕТ ИХ СООТВЕТСТВИЕ ВАШИМ НУЖДАМ И/ИЛИ ОЖИДАНИЯМ, ИХ БЕЗОПАСНОСТЬ, СТАБИЛЬНУЮ РАБОТУ, А ТАКЖЕ ОТСУТСТВИЕ В НИХ КАКИХ БЫ
                    ТО НИ БЫЛО ВИРУСОВ ИЛИ ЛЮБЫХ ДРУГИХ ВРЕДОНОСНЫХ КОМПОНЕНТОВ.</p>


                <p>AZUR GAMES И ЕГО СОТРУДНИКИ, НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ, НЕ НЕСУТ ОТВЕТСТВЕННОСТЬ ПЕРЕД ВАМИ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ СЛУЧАЙНЫЕ УБЫТКИ, ВКЛЮЧАЯ ФАКТИЧЕСКИЕ УБЫТКИ, ШТРАФНЫЕ САНКЦИИ, УПУЩЕННУЮ ВЫГОДУ ИЛИ ПОТЕРЮ
                    ДАННЫХ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ ВНЕ ЗАВИСИМОСТИ ОТ ОЖИДАЕМОСТИ ДАННОГО УЩЕРБА.</p>

                <br/>

                <p><strong>9. ОБНОВЛЕНИЯ УСЛОВИЙ ПОЛЬЗОВАНИЯ</strong></p>


                <p>Вы осознаете и соглашаетесь, что Azur Games оставляет за собой право обновлять, вносить изменения или править данные Условия Пользования и/или Политику конфиденциальности в любое время посредством публикации обновленной версии на
                    веб-сайт azurgames.com. Обновленные Условия Пользования и/или Политика конфиденциальности вступают в силу незамедлительно с момента публикации на azurgames.com. Вам рекомендуется время от времени проверять веб-сайт на наличие
                    подобных обновлений.</p>


                <p>Только английская версия данного документа имеет юридическую силу. Все переводы данного документы предоставлены исключительно для вашего удобства.</p>


                <p>Если у вас возникли вопросы касательно данных Условий Пользования, вы можете отправить их на следующий электронный адрес:</p>

                <a href="mailto:policy@azurgames.com">policy@azurgames.com</a>
            </div>
        </main>
    );
}

export default TermsOfUse;